Repository: herux/protobuf-fpc
Catalog: languages/xmlobject_resource.*.po
Languages: ru

source: Class property not init %s
ru: Сложное свойство не инициализировано %s

source: Not assigned XML file
ru: Не указан XML файл

source: Not found property in %s for data field %s
ru: Не найдено свойство в %s для поля %s

source: Object %s. Property %s not assigned
ru: Класс %s. Свойство %s не инициализированно

source: Property is not class type %s
ru: Свойство %s не типа класс

source: Not fond property %s.%s(%s)
ru: Не найдено свойство %s.%s(%s)

# xmlobject_resource.spropertynotfound1
source: %s : property %s not found
ru: %s : свойство %s не найдено

# xmlobject_resource.spropertynotfound2
source: Not fond property %s
ru: Не найдно свойство %s

source: %s: property %s requared value
ru: %s: Свойство %s требует значения

source: Uknow property type %s
ru: Не известный тип поля %s

source: Unknow class property %s.%s
ru: Не известное свйоство класса %s.%s

source: Unknow object - %s
ru: Не известный объект - %s

source: %s.%s - Attribs value is grated (%s - %d)
ru: %s.%s - Значение атрибуте больше чем (%s - %d)

source: %s.%s : value %s greater than %d
ru: %s.%s : значение %s больше чем %d

source: Property %s : value %g is greated %g
ru: Свойство %s : значение %g больше чем %g

source: Property %s : value %d is greated %d
ru: Свойство %s : значение %d больше чем %d

source: Property %s : value %g is lowered that %g
ru: Свойство %s : значение %g меньше чем %g

source: Property %s : value %d is lowered that %d
ru: Свойство %s : значение %d меньше чем %d

source: Property %s : value %s not equal to fixed value %s
ru: Свойство %s : Значение %s не равно фиксированному значнию %s

source: Property %s : value %d not in equal to fixed value %s
ru: Свойство %s : значение %d не равно фиксированному значению %s

source: %s.%s : value %s shorter that %d
ru: %s.%s : Значение %s короче чем %d
